charliermarsh.ruff
detachhead.basedpyright
esbenp.prettier-vscode
metaphore.kanagawa-vscode-color-theme
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
piousdeer.adwaita-theme
vscodevim.vim
